{"low terminal QRS spatial velocity": "Low terminal QRS spatial velocity is diagnosed by observing a decrease in the amplitude of the final part of the QRS complex in the precordial leads (V1-V6) of a 12-lead ECG.", "ST-T changes": "Look for ST elevation or depression in leads II, III, aVF (inferior), V1-V4 (anterior), I, aVL (lateral), V5, V6 (lateral). T wave inversion may indicate ischemia. ST elevation can suggest myocardial infarction. Always compare with previous ECGs if available.", "atrioventricular dissociation": "Look for P waves and QRS complexes occurring independently of each other on the ECG. This means the atria and ventricles are not communicating properly, indicating atrioventricular dissociation.", "tall P waves in inferior leads": "Tall P waves in inferior leads are seen in leads II, III, and aVF on a 12-lead ECG. Look for P wave amplitude > 2.5mm in these leads, which indicates right atrial enlargement, often termed 'P pulmonale'.", "inferior ST-T changes": "Inferior ST-T changes are typically seen in leads II, III, and aVF. Look for ST-segment elevation or depression, T-wave inversion, or Q waves in these leads. These changes may indicate inferior wall myocardial infarction or ischemia.", "atrial fibrillation": "Look for irregularly irregular rhythm, absence of P waves, and variable ventricular response in the ECG. Leads II, III, and aVF often provide the clearest view of these features.", "inferior and lateral ST segment elevation": "Inferior ST elevation is seen in leads II, III, and aVF. Lateral ST elevation appears in leads I, aVL, V5, and V6. Look for upward shifts from baseline in these leads.", "right axis deviation": "Check leads I and aVF on the ECG. If the QRS complex is negative in lead I and positive in aVF, it indicates right axis deviation. This suggests the electrical heart axis is deviated between +90 and +180 degrees.", "borderline anteroseptal T wave changes": "Look at leads V1-V3 for anteroseptal changes. Borderline T wave changes may show slight flattening or inversion. However, these changes can be normal variants. Always correlate with patient's clinical status and consider other ECG findings.", "acute anterolateral myocardial infarction": "Look for ST-segment elevation in leads I, aVL, V5, and V6. Reciprocal changes may appear in inferior leads. Q waves may develop. These indicate acute anterolateral myocardial infarction.", "left atrial enlargement": "Look for P wave changes in lead II (P mitrale): a bifid P wave with a >40ms gap between the peaks. Also, check lead V1 for a biphasic P wave with a terminal negative component >40ms in duration and >1mm in depth.", "multiple premature ventricular complexes": "Look for irregular heart rhythm with extra beats in ECG. Premature ventricular complexes (PVCs) often show a wide QRS complex with abnormal shape. They can appear in any lead but are often noticeable in V1-V6, II, III, and aVF. PVCs may have no P wave or an inverted one.", "inferior and anterior/septal ST-T changes": "Inferior ST-T changes are seen in leads II, III, and aVF. Anterior/Septal changes appear in V1-V4. Look for ST elevation or depression, T wave inversion, or abnormal Q waves. These changes may indicate myocardial ischemia or infarction.", "frequent atrial premature complex": "Look for irregular rhythm with early P waves in leads II, III, and aVF. P waves may have different morphology. The PR interval is often shorter before premature beats. The QRS complex usually remains normal unless there's an underlying condition.", "old posterior myocardial infarction": "Look for ST depression and tall R waves in leads V1-V3, indicating posterior infarction. These are reciprocal changes due to infarction in the posterior wall of the heart, which is not directly viewed by the 12-lead ECG.", "atrial premature complex": "Look for irregular rhythm in ECG. Atrial Premature Complex (APC) is identified by early P wave that differs in shape from normal P waves. It can be seen in any lead but often prominent in leads II, III, aVF, V1 and V6.", "low voltage": "Low voltage in a 12-lead ECG is diagnosed when the amplitude of all QRS complexes in the limb leads is less than 5mm, or less than 10mm in the precordial leads. Focus on leads I, II, III, aVF, V1-V6.", "abnormal extreme QRS axis deviation": "Look at leads I and aVF. If QRS complex is positive in both, axis is normal. If negative in both, it's extreme. If positive in I and negative in aVF, axis is leftward. If negative in I and positive in aVF, axis is rightward.", "rightward axis": "Check leads I and aVF on the ECG. If the QRS complex is positive (above the line) in aVF and negative (below the line) in lead I, it indicates a rightward axis. This suggests right ventricular hypertrophy or chronic lung disease.", "frequent ventricular premature complex": "Look for premature beats with wide QRS complexes, often with a \"bizarre\" morphology, in the 12-lead ECG. These beats are not preceded by a P wave, indicating they originate from the ventricles. They often occur in a regular pattern, such as every 3rd or 4th beat (bigeminy or trigeminy).", "inferior and anterior/septal ST segment elevation": "Inferior ST elevation is seen in leads II, III, and aVF. Anterior/Septal ST elevation appears in V1-V4. Look for elevated ST segments at least 1mm above baseline. Also, check for reciprocal changes in opposite leads.", "intermittent conduction defect": "Look for irregular heart rhythms, P waves not followed by QRS complexes, and varying PR intervals in the 12-lead ECG. Focus on leads II, III, and aVF for AV block diagnosis. For bundle branch blocks, examine V1-V6.", "right ventricular conduction delay": "Look for prolonged QRS duration (>120ms) in lead V1 with a right bundle branch block (RBBB) pattern. Also, check for delayed S-wave upstroke in leads I and V6. These are indicative of right ventricular conduction delay.", "inferior and septal ST-T changes": "Inferior ST-T changes are seen in leads II, III, and aVF. Septal changes appear in V1 and V2. Look for ST elevation or depression, T wave inversion, or abnormal Q waves. These changes may indicate myocardial ischemia or infarction.", "acute ST segment elevation myocardial infarction": "Look for ST segment elevation in two contiguous leads: V1-V4 (anterior wall), II, III, aVF (inferior wall), I, aVL, V5-V6 (lateral wall). Also, check for reciprocal changes. The elevation should be >1mm in limb leads and >2mm in precordial leads.", "3:1 atrioventricular block": "Look for a regular ventricular rate slower than the atrial rate, with a 3:1 P:QRS ratio. P waves are not followed by QRS complexes in a 1:1 ratio. The PR interval remains constant. The QRS complex is usually normal unless there's a concurrent bundle branch block.", "non-specific T wave abnormalities in diffuse lead": "Look for T wave inversion, flat T waves, or biphasic T waves in multiple leads. Pay attention to leads II, III, aVF (inferior), V4-V6 (lateral), and V1-V3 (anterior). Compare with patient's baseline ECG if available. Always correlate with clinical symptoms.", "anteroseptal myocardial infarction": "Look for ST-segment elevation in leads V1-V3 and I, aVL (anteroseptal leads). Q waves may also appear in these leads. These changes indicate an anteroseptal myocardial infarction.", "anterior/septal and lateral T wave changes": "Anterior/Septal T wave changes are seen in leads V1-V4. Look for inversion or flattening. Lateral T wave changes appear in leads I, aVL, V5-V6. Again, check for inversion or flattening. These changes may indicate ischemia or infarction.", "low R waves in V2,V3,V4 leads": "Look at V2, V3, V4 leads in the 12-lead ECG. Low R waves are indicated by a small upward deflection. Compare with other leads. If R wave in V2-V4 is smaller than in other leads, it suggests low R waves. Also, consider patient's age and size.", "recent anteroseptal myocardial infarction": "Look for ST elevation in leads V1-V4, indicative of anteroseptal damage. Q waves may also appear in these leads, signifying necrosis. T-wave inversion can indicate recent infarction.", "predominant 4:1 atrioventricular block": "Look for a 4:1 P to QRS ratio in the ECG. This means for every 4 atrial beats (P waves), there's 1 ventricular beat (QRS complex). The P waves will be regular, but QRS complexes will be less frequent. This pattern across multiple leads confirms a 4:1 AV block.", "broad R or R' in V1 or V2 leads": "Look at leads V1 and V2 on the ECG. Broad R or R' is diagnosed when the R wave is wider than 0.04 seconds or if there is an R' (extra upward deflection). This could indicate a bundle branch block or ventricular hypertrophy.", "inferior and anterior/septal T wave changes": "Inferior T wave changes are seen in leads II, III, and aVF. Anterior/septal changes appear in V1-V4. Look for inversion, flattening, or hyperacute changes in T waves. These may indicate ischemia, infarction, or other cardiac conditions. Always correlate with clinical symptoms.", "ectopic atrial rhythm": "Look for P waves with abnormal morphology in leads II, III, and aVF. The P wave may precede, follow, or bury within the QRS complex. The PR interval may be normal or prolonged. The rate is usually 60-100 bpm. The rhythm is regular.", "normal ECG except for rate": "Focus on P wave, QRS complex, and T wave in all 12 leads. Check for regularity, intervals, and wave morphology. Look for abnormalities like arrhythmias, ischemia, or infarction. Each lead provides different information about heart's electrical activity.", "irregular sinus bradycardia": "Look for a regular rhythm with a heart rate less than 60 bpm on the ECG. P waves should be present and normal, indicating the rhythm is originating from the sinus node. Check all 12 leads to ensure consistency across the ECG.", "QRS changes in V3/V4 leads": "Focus on the amplitude, duration, and morphology of QRS complexes in V3/V4. Look for changes like ST elevation/depression, T wave inversion, or abnormal Q waves. These could indicate myocardial infarction, hypertrophy, or bundle branch block.", "ST segment depression": "Look for horizontal or downsloping ST segment depression ≥0.5mm in two contiguous leads in 12-lead ECG. It's often seen in leads V5-V6, II, III, aVF. It indicates myocardial ischemia or digoxin effect.", "slow sinus arrhythmia": "Look for a heart rate less than 60 bpm on the ECG. Sinus arrhythmia typically shows a regular variation in the P-P interval. The P wave will be normal and upright in leads I, II, aVF and V4-V6. The rhythm will be irregular but with a pattern, often linked to breathing.", "idioventricular rhythm": "Look for a slow heart rate (20-40 bpm), wide QRS complexes (>0.12 sec), absence of P waves or P waves unrelated to QRS complexes, and a regular rhythm. These features in 12-lead ECG suggest idioventricular rhythm.", "irregular rate": "Focus on lead II for rate and rhythm. Count the number of QRS complexes in a 10-second strip and multiply by 6 for heart rate. Irregularity can be identified by inconsistent intervals between QRS complexes.", "predominant 3:1 atrioventricular block": "Look for a regular ventricular rhythm with every third P wave followed by a QRS complex in the ECG. The other two P waves are not followed by a QRS, indicating the 3:1 block. This pattern should be consistent across multiple leads.", "anterior ST-T changes": "Focus on leads V1-V4 for anterior ST-T changes. Look for ST elevation or depression, T wave inversion, or abnormal Q waves. These changes may indicate myocardial ischemia or infarction in the anterior wall of the left ventricle.", "borderline first degree atrioventricular block": "Look for a prolonged PR interval (>200ms) in multiple leads on the ECG. This indicates a delay in electrical conduction from the atria to the ventricles, which is characteristic of a first degree atrioventricular block.", "inferior T wave changes": "Inferior T wave changes are typically seen in leads II, III, and aVF. Look for inversion, flattening, or asymmetry in these leads. These changes may indicate ischemia, electrolyte imbalance, or ventricular hypertrophy. Always correlate with clinical symptoms and history.", "ventricular bigeminy": "Ventricular bigeminy is diagnosed on a 12-lead ECG by identifying a pattern of one normal beat followed by one premature ventricular contraction (PVC) consistently. Look for wide, bizarre QRS complexes (PVCs) following each normal QRS complex in all leads.", "non-specific lateral T wave changes": "Look for T wave changes in lateral leads (I, aVL, V5, V6). Non-specific changes may include T wave inversion, flattening, or asymmetry. These changes can be subtle, so compare with previous ECGs if available. Always correlate with clinical context.", "borderline lateral ST segment elevation": "Look for ST segment elevation in leads I, aVL, V5, and V6. Borderline elevation is typically 1-2mm. Also, check for reciprocal changes in inferior leads. Remember, borderline elevation may indicate early myocardial infarction or ischemia, but further diagnostic tests are needed for confirmation.", "irregular ectopic atrial rhythm": "Look for irregular rhythm with P waves that differ in shape from normal sinus P waves. These ectopic P waves may appear before, within, or after the QRS complex. The rate is usually 60-100 bpm. Check all 12 leads for comprehensive analysis.", "ST segment junctional depression": "Look for ST segment depression in leads II, III, aVF (inferior leads) or V1-V6 (anterior and lateral leads). It's typically horizontal or downsloping. Depression must be at least 0.5mm below baseline 80ms after the J point. It may indicate myocardial ischemia.", "anterior myocardial ischemic": "Look for ST-segment elevation in the anterior precordial leads (V1-V4). This indicates an anterior myocardial ischemia. Also, reciprocal changes (ST depression) in inferior leads (II, III, aVF) can be present.", "frequent multifocal ventricular premature complex": "Look for irregular rhythm with premature beats on ECG. Multifocal VPCs have different morphologies in the same lead. Check leads V1-V6 for QRS complex shape, size, and direction. Note the absence of a P wave before the premature beat and a compensatory pause after.", " Q wave in inferior leads": "Look at leads II, III, and aVF for inferior leads. A pathological Q wave is typically wider than 40ms or deeper than 25% of the R wave. It indicates myocardial infarction if present.", "marked left axis deviation": "Look at leads I and aVF. If the QRS complex is negative in lead I and positive in aVF, it indicates a marked left axis deviation. This could be due to left anterior fascicular block, ventricular hypertrophy, or an infarction.", "extensive Q waves": "Look for Q waves wider than 0.04 seconds or deeper than 1/3 the height of the R wave in two or more contiguous leads. This typically indicates myocardial infarction. Leads II, III, aVF reflect inferior wall, V1-V4 anterior wall, and I, aVL, V5, V6 lateral wall.", "recent inferior myocardial infarction": "Look for ST-segment elevation in inferior leads (II, III, aVF). Pathological Q waves or T-wave inversion may also be present. These changes indicate recent inferior myocardial infarction.", "sinus/atrial tachycardia": "Look for a heart rate over 100 bpm, regular rhythm, and P waves preceding each QRS complex in the ECG. P waves should be upright in leads I, II, aVF and V2-V6. These are indicative of sinus/atrial tachycardia.", "abnormal ECG": "Focus on rate, rhythm, axis, P wave, QRS complex, ST segment, and T wave. Look for irregularities, abnormal shapes, or durations. Each lead provides a different view, so abnormalities may appear in specific leads. Practice and experience are key.", "inferior and anterior T wave changes": "Inferior T wave changes are seen in leads II, III, and aVF. Anterior T wave changes are seen in V1-V4. Look for inversion, flattening, or hyperacute changes in these leads. Always compare with previous ECGs if available.", "multifocal interpolated ventricular premature complex": "Look for premature ventricular complexes (PVCs) with varying morphologies in multiple leads. Multifocal PVCs indicate different ventricular origins. Interpolated PVCs occur without disturbing the underlying rhythm, appearing between two normal beats. Check for absence of compensatory pause post-PVC.", "prolonged QRS duration": "Look at leads I, II, and V1-V6 on the ECG. Prolonged QRS duration is typically >0.12 seconds (3 small squares). It indicates delayed ventricular depolarization, often due to bundle branch block or ventricular rhythm.", "acute anteroseptal myocardial infarction": "Look for ST elevation in leads V1-V4, indicative of anteroseptal damage. Q waves may also appear in these leads. Reciprocal changes can occur in inferior leads. These are key signs of acute anteroseptal myocardial infarction.", "non-specific septal ST segment changes": "Look for ST segment changes in leads V1-V3, which represent septal area. Non-specific septal ST changes can be slight elevation or depression, flat, or biphasic. These changes can be normal variants, but persistent or significant changes may suggest ischemia or injury.", "borderline anterior T wave changes ": "Look at leads V1-V4 for anterior T wave changes. Borderline changes may include slight flattening or inversion of T waves. Also, consider patient's age, sex, and race as these factors can influence T wave morphology. Always correlate with clinical context.", "unsustained ventricular tachycardia": "Look for three or more consecutive rapid heartbeats originating from the ventricles, with a rate over 100 beats per minute on the ECG. Key leads are V1-V6, II, III, and aVF. Focus on wide QRS complexes, abnormal axis, and absence of P waves.", "atypical left bundle branch block": "Look for broad QRS (>120ms), dominant S wave in V1, and broad monophasic R wave in leads I, aVL, V5, and V6. Absence of Q waves in leads I, V5, and V6 may indicate atypical left bundle branch block.", "broad R wave in I, V5 or V6 leads": "Look at leads I, V5, and V6 on the ECG. Broad R wave is diagnosed when the R wave is wider than usual. It's often associated with left ventricular hypertrophy or bundle branch block. Look for an R wave duration >0.04 seconds or R wave >26mm in these leads.", "hypertrophy": "Look for increased voltage in leads V1-V6 for left ventricular hypertrophy (LVH), and in leads II, III, and aVF for right ventricular hypertrophy (RVH). Also, check for ST-T wave changes. Remember, ECG is not definitive; confirm with echocardiography.", "borderline inferior and anterior T wave changes": "Look for T wave inversion or flattening in inferior leads (II, III, aVF) for borderline inferior changes. For anterior changes, focus on precordial leads (V1-V6). Also, consider patient's age, sex, and clinical history as these changes can be normal variants.", "low voltage in the extremity and precordial leads": "Low voltage in a 12-lead ECG is diagnosed when the amplitude of all QRS complexes in the limb leads is <5mm or <10mm in precordial leads. Focus on leads I, II, III, aVF, aVL, aVR, and V1-V6.", "non-specific septal ST-T changes": "Look for ST segment depression or T wave inversion in leads V1-V3. These changes may indicate non-specific septal ST-T changes. However, it's crucial to correlate with clinical symptoms and history, as these changes can be seen in various conditions.", "interpolated ventricular premature complex": "Interpolated ventricular premature complex (VPC) is diagnosed when a VPC occurs without disturbing the underlying rhythm. On a 12-lead ECG, look for a premature, wide QRS complex (>120 ms) with abnormal morphology, inserted between two normal beats without altering the regular rhythm.", "supraventricular bigeminy": "Supraventricular bigeminy on a 12-lead ECG is characterized by a normal QRS complex followed by a premature atrial contraction (PAC). Look for a P wave that comes earlier than expected, often with a different shape, followed by a normal QRS complex. This pattern repeats every other beat.", "anteroseptal ST segment changes": "Focus on leads V1-V4 for anteroseptal changes. Look for ST elevation or depression, T wave inversion, or Q waves. These changes may indicate myocardial infarction or ischemia in the anteroseptal region of the heart.", "anteroseptal T wave changes": "Focus on leads V1-V4 for anteroseptal region. Look for T wave inversion or flattening, which may indicate ischemia. Also, check for ST segment changes. Remember, these findings should be interpreted in clinical context.", "ventricular couplets": "Look for two consecutive premature ventricular contractions (PVCs) on the ECG. Ventricular couplets typically appear wide and bizarre. They may occur in any lead but are often most noticeable in the precordial leads (V1-V6).", "hyperkalemia": "Look for tall, peaked T waves, especially in leads V2-V4. Also, check for a widened QRS complex and a prolonged PR interval. These are classic ECG changes in hyperkalemia.", "low QRS voltages in precordial leads": "Low QRS voltages in precordial leads are diagnosed when the amplitude of the QRS complex is less than 5mm in all precordial leads (V1-V6) on a 12-lead ECG. Look for small, weak signals in these leads.", "ventricular trigeminy": "Ventricular trigeminy is diagnosed on a 12-lead ECG by identifying a pattern of two normal beats followed by a premature ventricular contraction (PVC). This pattern repeats consistently. PVCs often have a wide QRS complex and an abnormal T wave in most leads.", "inferior ST segment elevation": "Inferior ST segment elevation is diagnosed in leads II, III, and aVF on a 12-lead ECG. Look for ST segment elevation >1mm in two contiguous leads. Also, reciprocal changes (ST depression) may be seen in opposing leads (I, aVL).", "borderline anterolateral ST segment depression": "Look for subtle changes in leads I, aVL, V5, and V6. Specifically, focus on slight ST segment depression (0.5mm-1mm) that's horizontal or downsloping, and T wave inversion. These changes may indicate borderline anterolateral ischemia.", "4:1 atrioventricular block": "Look for a regular ventricular rate slower than the atrial rate, with a 4:1 P:QRS ratio. P waves are not followed by QRS complexes in a 1:1 ratio. Check leads II, III, and aVF for clear P waves.", "anterolateral ST segment elevation": "Look for ST segment elevation in leads I, aVL, V5, and V6. These leads represent the anterolateral wall of the heart. Elevation suggests myocardial infarction. Also, check for reciprocal changes in inferior leads (II, III, aVF).", "non-specific inferior T wave changes": "Focus on leads II, III, and aVF for inferior changes. Non-specific T wave changes may include inversion, flattening, or asymmetry. However, these changes can be benign or indicative of ischemia, electrolyte imbalance, or strain patterns. Always correlate with clinical context.", "septal ST segment changes": "Look at leads V1-V3 for septal ST changes. ST elevation may indicate septal myocardial infarction. ST depression could suggest ischemia. Always compare with patient's baseline ECG and consider clinical context.", "non-specific intraventricular conduction delay": "Look for widened QRS complex (>120ms) in multiple leads on the ECG. It's non-specific if there's no typical right or left bundle branch block pattern. The delay can be anywhere within the ventricular conduction system.", "non-specific anterolateral ST-T changes": "Look for ST segment elevation or depression, T wave inversion in anterolateral leads (I, aVL, V4-V6). These changes may be subtle. Also, consider patient's symptoms, risk factors. Non-specific changes can be due to ischemia, electrolyte imbalance, medication, etc. Always correlate with clinical picture.", "bigeminal ventricular premature complex": "Look for a regular pattern of one normal beat followed by a premature ventricular contraction (PVC) in the ECG. PVCs have wide, abnormal QRS complexes. Bigeminy means every other beat is a PVC. Check all 12 leads for a comprehensive view.", "atrioventricular sequential pacing pattern": "Look for pacing spikes before each P and QRS complex in multiple leads. Regular rhythm, narrow QRS complexes, and consistent PR interval suggest atrioventricular sequential pacing. Pacing spikes are key.", "anterolateral T wave changes": "Look at leads I, aVL, V5, and V6 for lateral changes, and V1-V4 for anterior changes. Focus on T wave inversion, flat T waves, or ST segment changes. These could indicate ischemia, infarction, or other cardiac conditions.", "reversed R wave progression in V2,V3,V4 leads": "Look for R wave progression reversal in V2, V3, V4 leads. Normally, R wave should increase from V1 to V4. If R wave is larger in V2 than V3 or V4, it indicates reversed R wave progression. This could suggest conditions like right ventricular hypertrophy or anterior myocardial infarction.", "premature complexes": "Premature complexes show early, abnormal beats. Look for P waves that occur sooner than expected, with abnormal shape in relevant leads. Premature atrial complexes (PACs) often have different P wave morphology, while premature ventricular complexes (PVCs) show wide, bizarre QRS complexes.", "acute lateral myocardial infarction": "Look for ST-segment elevation in lateral leads (I, aVL, V5-V6). Reciprocal changes may appear in inferior leads (II, III, aVF). Q waves may develop. These changes indicate acute lateral myocardial infarction.", "rapid ventricular response": "Look for a fast heart rate (>100 bpm) on the ECG. Check the QRS complexes; if they're narrow, it's likely supraventricular. If they're wide, it could be ventricular tachycardia. Irregular rhythm may indicate atrial fibrillation with rapid ventricular response. Always confirm with clinical symptoms.", "inferior/lateral ST segment changes": "Inferior ST changes are seen in leads II, III, and aVF. Lateral ST changes appear in leads I, aVL, V5, and V6. Look for ST elevation or depression, T wave inversion, or new Q waves. These changes may indicate myocardial ischemia or infarction.", "dual chamber pacemaker": "Look for pacing spikes in both atrial and ventricular leads. Atrial spikes precede P waves and ventricular spikes precede QRS complexes. Regular rhythm and narrow QRS complexes suggest dual chamber pacing.", "fusion complexes": "Fusion complexes on a 12-lead ECG appear as a blend of normal and abnormal waveforms. Look for irregularities in QRS complexes, particularly in leads V1-V6. They may appear wider and different from typical complexes, indicating a fusion of ventricular and supraventricular impulses.", "inferior myocardial injury": "Inferior myocardial injury is diagnosed on a 12-lead ECG by looking for ST-segment elevation in the inferior leads (II, III, and aVF). Reciprocal changes may also be seen in the lateral leads (I, aVL).", "myocardial injury": "Look for ST-segment elevation or depression, T-wave inversion, and pathological Q waves in the 12-lead ECG. These changes in leads V1-V4 indicate anterior wall injury, II, III, aVF for inferior wall, and I, aVL, V5-V6 for lateral wall.", "leftward axis": "Check leads I and aVF on the ECG. If the QRS complex is positive in lead I and negative in aVF, it indicates a leftward axis. This could suggest conditions like left ventricular hypertrophy or left anterior fascicular block.", "Wolf-Parkinson-White syndrome": "Look for a short PR interval (<120 ms) and a delta wave (slurred upstroke at the beginning of the QRS complex) in the 12-lead ECG. These are hallmark features of Wolf-Parkinson-White syndrome.", "acute myocardial ischemia": "Look for ST-segment elevation in contiguous leads, T-wave inversion, or new left bundle branch block. These are indicative of acute myocardial ischemia. Also, consider patient symptoms and risk factors.", "low R waves in anterior leads": "Look at leads V1-V4 on the ECG. Low R waves are characterized by an R wave amplitude of less than 3mm. This could indicate myocardial infarction, ventricular hypertrophy, or conduction abnormalities. Always correlate with clinical symptoms and other ECG findings.", "acute inferolateral myocardial infarction": "Look for ST-segment elevation in leads II, III, aVF (inferior wall) and I, aVL, V5-V6 (lateral wall). Reciprocal changes may appear in opposing leads. Q waves may develop. These indicate acute inferolateral myocardial infarction.", "rSr' pattern in V1 lead": "In V1 lead, look for a small R wave, followed by a deep S wave, then a second R wave (rSr'). This pattern suggests right bundle branch block or incomplete right bundle branch block.", "septal ST segment elevation": "Look for ST segment elevation in leads V1-V3 on a 12-lead ECG. This indicates septal involvement. Also, check for reciprocal changes in other leads. Remember, ST elevation should be new and correlate with symptoms for a diagnosis of myocardial infarction.", "tachycardia": "Look for a heart rate over 100 bpm on the ECG. Check leads II, III, and aVF for P wave abnormalities. Examine QRS complex duration; if it's wide, it may indicate ventricular tachycardia. Always correlate with clinical symptoms.", "non-specific lateral ST-T changes": "Look for changes in leads I, aVL, V5, and V6. Focus on ST-segment elevation or depression, T-wave inversion, or abnormal Q-waves. These changes may indicate myocardial ischemia, injury, or infarction in the lateral wall of the left ventricle.", "T wave abnormality": "Look for T wave inversion in leads V1-V4, which may indicate ischemia. T wave flattening or inversion in other leads could suggest electrolyte imbalance. Tall, peaked T waves may indicate hyperkalemia. Always compare with previous ECGs if available.", "third degree atrioventricular block": "Look for complete dissociation between P waves and QRS complexes in all leads. P waves have regular rhythm, but QRS complexes may be irregular. The QRS complex can be wide if the block is at or below the bundle of His.", "sinus rhythm": "Look for regular P waves preceding each QRS complex in all leads. The P wave should be upright in leads I, II, aVF and V2-V6. The rate should be 60-100 bpm. PR interval should be 0.12-0.20 sec and QRS duration <0.12 sec.", "right atrial enlargement": "Look for tall P waves (greater than 2.5mm) in leads II, III, and aVF, known as 'P pulmonale'. Also, check for a peaked P wave in V1 and V2. These are indicative of right atrial enlargement.", "left atrial abnormality": "Look for P wave changes in lead II (biphasic with negative component) and lead V1 (biphasic with positive component). P wave duration > 0.12 seconds or P wave terminal force in V1 > 0.04 seconds are indicative of left atrial abnormality.", "non-specific lateral ST segement changes": "Focus on leads I, aVL, V5, and V6 for lateral ST changes. Look for ST elevation or depression, T wave inversion, or abnormal Q waves. These changes may indicate myocardial ischemia, injury, or infarction. Always correlate with clinical symptoms and history.", "multiform ventricular premature complexes": "Look for irregular rhythm with premature beats on ECG. Premature beats have wide, abnormal QRS complexes. Multiform complexes vary in shape, indicating they originate from different ventricular sites. Check all 12 leads, but V1-V6 are particularly useful for identifying ventricular origin.", "non-specific inferior ST-T changes": "Look at leads II, III, and aVF for inferior changes. Non-specific ST-T changes can include slight ST depression or elevation, T wave inversion, or flat T waves. These changes are often subtle and may not indicate a specific disease, but could suggest ischemia or strain.", "myocardial ischemic in anterolateral leads": "Look for ST-segment elevation in leads I, aVL, V5, and V6. These indicate anterolateral myocardial ischemia. Also, check for reciprocal changes in inferior leads (II, III, aVF). T-wave inversion or Q-waves may also be present.", "complete atrioventricular block": "Look for regular P waves with a constant PR interval, but QRS complexes that are not regularly associated with P waves. This indicates the atria and ventricles are beating independently, a key sign of complete atrioventricular block.", "non-specific intraventricular conduction disturbance (block)": "Look for widened QRS complex (>120 ms) in the ECG. It's not localized to a specific bundle branch, hence called non-specific. It may be due to myocardial diseases, electrolyte imbalances, or drug toxicity. Always correlate with clinical symptoms.", "sinus arrhythmia": "Look for regular variation in R-R intervals with respiration in ECG. In sinus arrhythmia, P waves are normal and the heart rate increases during inhalation and decreases during exhalation. It's often seen in leads II, III, and aVF.", "atrial tachycardia": "Look for a heart rate over 100 bpm, P waves before each QRS complex, and abnormal P wave morphology (notched, peaked, or different from sinus P waves) in multiple leads. P wave axis may also be abnormal.", "borderline lateral ST segment depression": "Look at leads I, aVL, V5, and V6 for lateral ST depression. Borderline lateral ST depression is typically 0.5-1mm below the baseline. It may indicate ischemia, but further tests are needed for a definitive diagnosis.", "borderline anterolateral ST segment elevation": "Look for slight elevation (1mm or less) in the ST segment in leads I, aVL, V5, and V6. These leads represent the anterolateral part of the heart. Also, check for reciprocal changes in other leads. Remember, borderline elevation may indicate early myocardial infarction or ischemia.", "occasional frequent atrial premature complex": "Look for irregular rhythm in ECG. Atrial Premature Complexes (APCs) often appear as abnormal P waves occurring earlier than expected, followed by a QRS complex. They can be seen in any lead but are most noticeable in leads II, III, aVF, V1 and V2.", "non-specific ST segment junctional depression": "Look for ST segment depression in multiple leads on the ECG, not localized to one specific area. This depression may be horizontal or downsloping. It's non-specific if it doesn't fit criteria for ischemia, strain, or digitalis effect. Always correlate with patient's symptoms and history.", "ST segment depression in V1,V2,V3 leads": "Look at leads V1, V2, V3 on the ECG. ST segment depression is diagnosed if the ST segment is below the baseline. It's typically indicative of myocardial ischemia. Also, consider the patient's symptoms and other ECG changes like T wave inversion.", "QRS changes in V2 leads": "Focus on the amplitude, duration, and morphology of QRS complex in V2 lead. Look for changes like Q wave enlargement, R wave progression, or S wave deepening. These could indicate myocardial infarction, right or left ventricular hypertrophy, or bundle branch blocks.", "predominant 2:1 atrioventricular block": "Look for a consistent pattern of two P waves (atrial contractions) followed by one QRS complex (ventricular contraction) across multiple leads. The P waves should be regular, but every second one is not followed by a QRS complex.", "shortened QT interval": "Look for a QT interval less than 350 milliseconds in any lead on the ECG. Pay attention to leads II, V5, and V6, where it's most visible. Remember, it's crucial to correct for heart rate using Bazett's formula.", "regular supraventricular rhythm": "Look for a regular rhythm, narrow QRS complexes, and P waves preceding each QRS complex in the ECG. Focus on leads II, III, and aVF for best P wave visibility. If P waves are absent, consider junctional rhythm or atrial fibrillation.", "secondary ST-T changes": "Look for ST depression or T wave inversion in leads V5-V6, II, III, aVF. These changes may indicate secondary ST-T changes. Also, consider underlying conditions like left ventricular hypertrophy or bundle branch block that can cause these changes.", "old septal myocardial infarction": "Look for Q waves in leads V1-V3 on the ECG. These indicate old septal myocardial infarction. The Q wave is pathologic if it's >0.04 seconds wide or >25% of the following R wave.", "left anterior fascicular block": "Look for left axis deviation (between -45 and -90 degrees) in the frontal plane, normal or slightly widened QRS complex, and small Q waves in leads I and aVL in the 12-lead ECG to diagnose left anterior fascicular block.", "tall R wave in V1/V2 leads": "Look at V1/V2 leads in the 12-lead ECG. Tall R wave is diagnosed when R wave is larger than S wave. It may indicate right ventricular hypertrophy, posterior myocardial infarction, or dextrocardia. Always correlate with clinical history and other ECG findings.", "atrial flutter/fibrillation": "Look for irregularly irregular rhythm in atrial fibrillation, and sawtooth pattern in atrial flutter on ECG. Leads II, III, and aVF often show these changes best. Absence of distinct P waves and variable R-R intervals are key features.", "septal myocardial infarction": "Diagnose septal myocardial infarction by focusing on leads V1 and V2 in a 12-lead ECG. Look for ST-segment elevation and pathological Q waves, which indicate myocardial necrosis.", "poor R wave progression": "Poor R wave progression is diagnosed by examining leads V1-V6 on a 12-lead ECG. Normally, R wave should increase from V1 to V4 and then decrease. If R wave is less than 3mm in V3 or transition occurs after V4, it indicates poor R wave progression.", "atrial premature complexes in couplets": "Look for irregular rhythm in ECG. Couplets of atrial premature complexes (APCs) show two consecutive abnormal P waves, often with different morphology than normal P waves. They may appear in any lead but are often more visible in leads II, III, aVF, V1, and V6.", "non-specific anterior/septal and lateral ST segment changes": "Look for ST segment elevation or depression in anterior/septal leads (V1-V4) for anterior changes. For lateral changes, check leads I, aVL, V5-V6. Note any T-wave inversion, Q-wave formation, or changes in R-wave progression. Always compare with previous ECGs if available.", "junctional rhythm": "Junctional rhythm on a 12-lead ECG is diagnosed by a regular rhythm, a heart rate of 40-60 bpm, and a P wave that is absent, inverted, or follows the QRS complex. Focus on leads II, III, and aVF.", "minimal ST segment depression in diffuse lead": "Look for subtle horizontal or downsloping ST depression ≥0.5mm in two or more contiguous leads in 12-lead ECG. Pay attention to leads II, III, aVF (inferior), V4-V6 (lateral), and V1-V3 (anterior). Also, consider patient symptoms and risk factors.", "rapid ventricular rate": "Look for a heart rate over 100 bpm on the ECG. Check leads II, III, and aVF for P waves before each QRS complex. If absent, it's ventricular. Also, examine QRS complexes. If they're wide (>0.12 sec), it's likely ventricular.", "unclassified ECG": "Focus on P wave, QRS complex, and T wave in all 12 leads. Look for rhythm regularity, heart rate, and axis deviation. Check for abnormalities like ST elevation/depression, T wave inversion, and Q wave presence. Each lead provides different heart view, aiding in accurate diagnosis.", "non-specific anterolateral T wave changes": "Look for T wave inversion or flattening in the anterolateral leads (I, aVL, V4-V6). These changes may indicate ischemia, electrolyte imbalance, or strain. However, \"non-specific\" means they don't point to a specific diagnosis, so consider patient's symptoms and history.", "atypical right bundle branch block": "Look for prolonged QRS duration (>120ms) in lead V1. The QRS complex should have an rSR' pattern, with the R' wave larger than the initial R wave. Also, check for delayed activation of the right ventricle in leads V1-V3.", "deep S wave in anteroseptal lead": "Look at leads V1-V3 for anteroseptal leads. Deep S wave is diagnosed when the negative deflection (S wave) is significantly deep or larger than the R wave. It may indicate right bundle branch block or anterior myocardial infarction.", "high degree atrioventricular block": "Look for prolonged PR interval (>200ms) in early stages. In advanced stages, observe for more P waves than QRS complexes, indicating blocked impulses. In third-degree block, there's no relation between P waves and QRS complexes. Leads II, III, and aVF are particularly useful.", "second degree atrioventricular block": "Look for irregular rhythm in ECG. In Type I (Wenckebach), progressive PR interval lengthening until a beat is dropped is seen. In Type II (Mobitz), PR interval remains constant, but some P waves are not followed by QRS complexes. These features are visible in all 12 leads.", "non-specific inferior and septal T wave": "Focus on leads II, III, aVF (inferior) and V1, V2 (septal). Non-specific T wave changes are subtle variations in T wave shape, size, or symmetry. Look for T wave inversion, flat T waves, or biphasic T waves. Always compare with previous ECGs if available.", "non-specific inferior T wave abnormalities": "Look at leads II, III, and aVF for inferior T wave abnormalities. Check for T wave inversion, flat T waves, or biphasic T waves. These changes may indicate ischemia, electrolyte imbalance, or ventricular hypertrophy. Always correlate with clinical symptoms and history.", "septal Q waves": "Septal Q waves are normal findings in leads I, aVL, V5, and V6. They are small, narrow, and less than 0.03 seconds in duration. If they are larger, wider, or in other leads, it may indicate myocardial infarction.", "borderline inferior ST segment elevation": "Look for slight elevation (0.5-1mm) in inferior leads (II, III, aVF). Check for reciprocal changes in opposing leads. Consider patient symptoms, history, and risk factors. Always correlate with clinical picture.", "marked sinus bradycardia": "Look for a regular rhythm with a heart rate less than 60 beats per minute on the ECG. The P wave should be normal and precede each QRS complex. Check all 12 leads, but lead II often provides the clearest view of P waves.", "short PR interval": "Look for a PR interval less than 120 milliseconds on any lead in the 12-lead ECG. This interval is measured from the start of the P wave to the start of the QRS complex.", "voltage criteria for left ventricular hypertrophy": "Look for increased R wave amplitude in left-sided leads (I, aVL, V5-V6) and increased S wave depth in right-sided leads (III, aVF, V1-V3). Sokolow-Lyon criteria: S in V1 + R in V5 or V6 > 35mm. Cornell criteria: R in aVL + S in V3 > 28mm (men), > 20mm (women).", "ventricular premature complex": "Look for premature beats with wide QRS complex (>120 ms) in the ECG. They often have a bizarre morphology, with a compensatory pause following the beat. They can appear in any lead but are often most noticeable in the chest leads (V1-V6).", "non-specific extensive ST-T changes": "Look for ST-segment elevation or depression, T-wave inversion across multiple leads. Non-specific changes may not localize to a single coronary artery territory. Consider patient's symptoms, history, and risk factors. Always correlate with clinical picture.", "non-specific inferior and anterior/septal T wave changes": "Look for T wave inversion or flattening in inferior leads (II, III, aVF) for non-specific inferior changes. For anterior/septal changes, focus on V1-V4. These changes may indicate ischemia, electrolyte imbalance, or ventricular hypertrophy. Always correlate with clinical symptoms and history.", "myocardial injury/ischemia": "Look for ST-segment elevation or depression, T-wave inversion, and Q waves in the 12-lead ECG. ST-elevation indicates acute injury, while ST-depression and T-wave inversion suggest ischemia. Q waves signify old myocardial infarction. The affected leads can hint at the location of the injury.", "borderline inferior/lateral ST-T changes": "Focus on leads II, III, aVF (inferior) and I, aVL, V5-V6 (lateral). Look for slight ST elevation or depression, T wave inversion or flattening. These changes may be subtle, transient, or rate-dependent. Always compare with previous ECGs if available. Clinical correlation is essential.", "acute anterior myocardial infarction": "Look for ST-segment elevation in the anterior leads (V1-V4) on the ECG. This elevation, along with reciprocal changes in other leads, indicates an acute anterior myocardial infarction.", "non-specific anterior/septal and lateral ST-T changes": "Look for ST segment elevation or depression in anterior/septal leads (V1-V4) for anterior changes. For lateral changes, check leads I, aVL, V5-V6. T wave inversion or abnormal Q waves may also indicate pathology. Always compare with patient's baseline ECG if available.", "aberrantly conducted supraventricular premature beats": "Look for P waves that precede QRS complexes in leads II, III, and aVF. Aberrantly conducted supraventricular premature beats show wide and abnormal QRS complexes, often resembling a bundle branch block pattern. Timing is key; these beats occur earlier than expected.", "incomplete right bundle branch block": "Look for RSR' pattern in V1-V3 leads on ECG. The QRS complex duration should be less than 120 ms. The R' wave in V1 or V2 should be smaller than the initial R wave.", "wide QRS tachycardia": "Look for a QRS duration >120 ms in any lead. Check V1 for a dominant R wave or no R wave, suggesting ventricular tachycardia. In lead II, look for an RS interval >100 ms, also suggesting ventricular tachycardia.", "myocardial infarction": "Look for ST elevation in two contiguous leads, new left bundle branch block, or development of Q waves. These are indicative of myocardial infarction. Also, consider reciprocal changes in opposite leads.", "borderline anterior ST segment elevation": "Look for slight elevation (1mm or less) in the ST segment in anterior leads (V1-V4). It's borderline if it's not clearly normal or indicative of myocardial infarction. Also, consider patient symptoms and risk factors. Always confirm with further diagnostic tests.", "Q wave abnormality": "Look for Q waves in leads II, III, aVF (inferior wall) or V1-V6 (anterior/septal wall). Abnormal if >40ms wide, >2mm deep, or >25% of following R wave. Indicates possible myocardial infarction.", "anterolateral myocardial injury": "Look for ST-segment elevation in leads I, aVL, V5, and V6. These leads represent the anterolateral wall of the heart. The elevation indicates myocardial injury.", "tall R wave in lateral leads": "Look at leads I, aVL, V5, and V6 for lateral leads. Tall R wave is diagnosed when R wave in these leads is larger than S wave. It may indicate left ventricular hypertrophy or anterior myocardial infarction.", "borderline extensive ST-T changes ": "Look for ST segment elevation or depression, T wave inversion in multiple leads. Borderline extensive ST-T changes often appear in leads V1-V6, I, II, aVL, aVF. Consider patient's symptoms, risk factors, and compare with previous ECGs if available.", "paroxysmal idioventricular rhythm": "Look for a regular rhythm with a rate of 20-50 bpm, absent P waves, and wide QRS complexes (>120 ms). The rhythm originates from the ventricles, hence the term idioventricular. It's paroxysmal, meaning it starts and ends abruptly.", "recent myocardial infarction": "Look for ST elevation in two contiguous leads, new left bundle branch block, or pathological Q waves. These are indicative of recent myocardial infarction. Also, consider patient symptoms and risk factors.", "lateral ST segment elevation": "Lateral ST segment elevation is typically seen in leads I, aVL, V5, and V6. Look for elevation of the ST segment above the baseline, indicating myocardial injury. This could suggest a lateral wall myocardial infarction.", "old inferior myocardial infarction": "Look for pathological Q waves in the inferior leads (II, III, aVF). These are indicative of old inferior myocardial infarction. Also, check for ST segment and T wave changes, though they may normalize over time.", "lateral myocardial infarction": "Lateral myocardial infarction is diagnosed on a 12-lead ECG by ST-segment elevation in the lateral leads (I, aVL, V5, V6). Look for Q waves and T wave inversion in these leads as well.", "r' > r in V1/V2 leads": "Look at V1/V2 leads in the ECG. If the R' wave (second upward deflection) is larger than the initial R wave, it indicates r' > r. This is often seen in conditions like right bundle branch block.", "accelerated junctional rhythm": "Look for a heart rate between 60-100 bpm, narrow QRS complexes, and absent or inverted P waves before QRS complexes in a 12-lead ECG. These are indicative of an accelerated junctional rhythm.", "marked right axis deviation": "Look at leads I and aVF. If the QRS complex is negative in lead I and positive in aVF, it indicates a marked right axis deviation. This could suggest conditions like right ventricular hypertrophy or chronic lung disease.", "right atrial abnormality": "Look for tall P waves (>2.5mm) in leads II, III, and aVF, or a peaked P wave in lead II. This indicates right atrial enlargement or abnormality, often referred to as 'P pulmonale'.", "anteroseptal ST-T changes": "Focus on leads V1-V4 for anteroseptal changes. Look for ST elevation or depression, T wave inversion, or Q waves. These changes may indicate myocardial ischemia or infarction in the anteroseptal region of the heart.", "inferior and anterior ST-T changes": "Inferior ST-T changes are seen in leads II, III, and aVF. Anterior changes are seen in V1-V4. Look for ST elevation or depression, T wave inversion, or abnormal Q waves. These changes may indicate myocardial ischemia or infarction.", "borderline lateral ST-T changes": "Look at leads I, aVL, V5, and V6 for lateral ST-T changes. Borderline changes may include slight ST elevation or depression, T wave inversion or flattening. These changes may indicate ischemia, but further tests are needed for a definitive diagnosis.", "indeterminate axis": "Indeterminate axis on a 12-lead ECG is diagnosed when both Lead I and aVF show negative deflections. This suggests the heart's electrical axis is not within the normal range (-30 to +90 degrees).", "right ventricular hypertrophy": "Look for tall R waves in V1 and deep S waves in V5 or V6. Also, check for right axis deviation and right precordial T-wave inversions. These are key indicators of right ventricular hypertrophy on a 12-lead ECG.", "sinus tachycardia": "Look for a regular rhythm with a heart rate over 100 bpm in a 12-lead ECG. P waves should be present and upright in leads I, II, and aVF, indicating normal sinus origin. The P wave should precede each QRS complex.", "non-specific inferior and anterior/septal ST-T changes": "Look for ST segment elevation or depression in inferior leads (II, III, aVF) for inferior changes, and in anterior/septal leads (V1-V4) for anterior/septal changes. T wave inversion may also indicate pathology. Always compare with previous ECGs if available.", "anteroseptal ST segment elevation": "Look for ST segment elevation in leads V1-V3, indicative of anteroseptal myocardial infarction. Also, check for reciprocal changes in other leads. The ST segment should be elevated >1mm in at least two contiguous leads.", "irregular sinus tachycardia": "Look for a heart rate over 100 bpm, regular rhythm, and upright P waves before each QRS complex in lead II. P wave axis should be normal (0-75 degrees). No other abnormalities should be present. Always consider patient's clinical context.", "lateral ST-T changes": "Lateral ST-T changes are typically seen in leads I, aVL, V5, and V6. Look for ST-segment elevation or depression, T-wave inversion, or Q waves in these leads, which may indicate lateral wall myocardial infarction or ischemia.", "septal T wave changes": "Look for T wave inversion in leads V1-V3, which may indicate septal T wave changes. Also, consider the patient's age, sex, and clinical history. These changes can be normal in children, women, and athletes, but may suggest ischemia or infarction in others.", "borderline extensive T wave changes": "Look for T wave inversion or flattening in multiple leads, especially in leads V1-V4. Also, check for ST segment changes. These could indicate borderline extensive T wave changes. Always correlate with clinical symptoms and patient history.", "non-specific inferior and anterior ST-T changes": "Focus on leads II, III, aVF for inferior changes, and V1-V6 for anterior changes. Look for ST-segment elevation or depression, T-wave inversion, or abnormal Q-waves. These changes may indicate myocardial ischemia or injury.", "non-specific extensive ST segment changes": "Look for ST segment elevation or depression in multiple leads on the ECG. Non-specific changes may not follow typical patterns of specific heart conditions. They can be diffuse, affecting many leads, and may vary in degree. Always correlate with clinical symptoms and history.", "non-specific anterior T wave changes": "Look for T wave inversion or flattening in anterior leads (V1-V4). Non-specific changes can be subtle, so compare with previous ECGs if available. Rule out ischemia, electrolyte imbalance, or medication effects. Always correlate with clinical symptoms.", "right bundle branch block": "Look for a widened QRS complex (>0.12 sec) in leads V1-V3 on the ECG. The QRS complex will have a 'rabbit ear' appearance (R, R', S pattern) in these leads. This indicates a delay in electrical conduction through the right bundle branch, known as Right Bundle Branch Block.", "repolarization abnormality": "Look for ST segment elevation or depression, T wave inversion, or QT interval prolongation in the 12-lead ECG. These changes may indicate repolarization abnormalities. Always compare with previous ECGs if available for better diagnosis.", "supraventricular tachycardia": "Look for a rapid heart rate (>100 bpm) on the ECG. In SVT, P waves may be hard to see. If visible, they may appear abnormal or be located just after the preceding T wave. Focus on leads II, III, and aVF for best P wave visibility.", "non-specific extensive T wave changes": "Look for T wave inversion or flattening in multiple leads. Non-specific changes can occur in any lead. Pay attention to the amplitude, symmetry, and duration of T waves. Also, consider patient's history and symptoms for accurate diagnosis.", "non-specific inferior/lateral T wave changes": "Focus on leads II, III, aVF (inferior) and I, aVL, V5-V6 (lateral). Look for T wave inversion, flattening, or asymmetry. These changes may be non-specific, but could indicate ischemia, electrolyte imbalance, or strain patterns. Always correlate with clinical context.", "prolonged QT interval": "Look at leads II, V5, or V6 on the ECG. Measure from the start of the Q wave to the end of the T wave (QT interval). If it's more than half the distance between two R waves (R-R interval), it's prolonged.", "left ventricular hypertrophy": "Look for increased R-wave amplitude in left-sided leads (I, aVL, V5-V6) and deep S-waves in right-sided leads (III, aVF, V1-V3). Also, check for left axis deviation and ST-T wave changes. These are indicative of Left Ventricular Hypertrophy (LVH) on a 12-lead ECG.", "ectopic atrial tachycardia": "Look for a heart rate over 100 bpm, P waves with abnormal morphology preceding each QRS complex, and a variable PR interval. These features are often most visible in leads II, III, and aVF.", "borderline ECG": "Look for slight abnormalities in P waves, QRS complexes, ST segments, or T waves across multiple leads. Borderline ECG often shows minor deviations from normal parameters, like slightly prolonged QT interval or mild left ventricular hypertrophy. Always correlate with clinical symptoms.", "2:1 atrioventricular block": "Look for a P wave not followed by a QRS complex in a regular pattern, indicating every second atrial impulse is blocked. This pattern is best seen in lead II. The PR interval of conducted beats remains constant.", "inferior Q waves": "Inferior Q waves are diagnosed on 12-lead ECG by focusing on leads II, III, and aVF. Look for small, negative deflections at the start of the QRS complex. These indicate myocardial infarction if they're >0.02 seconds wide or >1/3 the height of the R wave.", "extensive myocardial infarction": "Look for ST-segment elevation in two contiguous leads. V1-V4 elevation indicates anterior infarction, II, III, aVF for inferior, I, aVL, V5-V6 for lateral. Q waves may also indicate past infarction.", "lateral ST segment changes": "Look at leads I, aVL, V5, and V6 for lateral ST changes. ST elevation may indicate myocardial infarction, while ST depression could suggest ischemia. Also, check for T wave inversion, which may indicate myocardial ischemia or infarction.", "poor R wave progression in V2,V3,V4 leads": "Poor R wave progression is diagnosed when R wave height in V3 is less than 3mm or when R wave in V4 is less than 1mm. Look for a sudden transition from a dominant S wave to a dominant R wave between V2 and V4.", "left bundle branch block": "Look for broad QRS complex (>120ms) in leads I, V5, V6 with deep S waves in V1, V2. The R wave in V6 may have a 'notched' appearance. This indicates a delay in electrical conduction through the left bundle branch, hence Left Bundle Branch Block.", "borderline anterolateral T wave changes": "Look for subtle changes in leads I, aVL, V5, and V6. Focus on T wave inversion or flattening, slight ST segment depression, and QT interval prolongation. These changes may be transient or persistent. Always compare with previous ECGs if available.", "non-specific inferior and lateral T wave changes": "Look for T wave inversion or flattening in inferior (II, III, aVF) and lateral leads (I, aVL, V5-V6). These changes may indicate ischemia, electrolyte imbalance, or strain. However, non-specific changes can also be normal variants. Always correlate with clinical context.", "lateral myocardial ischemic": "Lateral myocardial ischemia is diagnosed on a 12-lead ECG by looking for ST-segment depression or T-wave inversion in the lateral leads (I, aVL, V5, V6). These changes suggest reduced blood flow to the lateral wall of the heart.", "sinus/ectopic atrial tachycardia": "Look for a heart rate over 100 bpm, regular rhythm, and P waves preceding each QRS complex in the ECG. In sinus tachycardia, P waves are upright in leads I, II, aVF and V4-V6. In ectopic atrial tachycardia, P wave morphology differs from sinus origin.", "septal and lateral ST-T changes": "Septal ST-T changes are typically seen in leads V1-V3, while lateral changes appear in leads I, aVL, V5-V6. Look for deviations from the baseline: ST elevation may indicate myocardial infarction, while ST depression or T wave inversion can suggest ischemia.", "borderline septal ST-T changes": "Look for ST segment depression or T wave inversion in leads V1-V3, indicating septal changes. Borderline changes are subtle, not meeting full criteria for ischemia. Always correlate with patient symptoms and history.", "inferior/lateral T wave changes": "Inferior T wave changes are seen in leads II, III, and aVF. Lateral T wave changes appear in leads I, aVL, V5, and V6. Look for inversion, flattening, or hyperacute changes in these leads. Always compare with previous ECGs if available.", "supraventricular premature beats": "Look for premature beats with narrow QRS complexes in the ECG. They originate above the ventricles, often with abnormal P wave morphology or timing. P wave may be hidden within or occur just after the preceding T wave. Check leads II, III, aVF, V1-V6.", "extensive ST-T changes": "Look for ST elevation or depression in multiple leads. Extensive ST-T changes often occur in contiguous leads. For example, changes in leads II, III, and aVF suggest inferior wall myocardial infarction. Also, check for T wave inversion or flattening.", "anterior fascicular block": "Look for left axis deviation (between -45 and -90 degrees) in the frontal plane, normal or slightly widened QRS complex, and 'rS' pattern in leads II, III, and aVF on the 12-lead ECG to diagnose anterior fascicular block.", "non-specific repolarization abnormality in diffuse leads": "Look for irregularities in the ST segment and T wave across multiple leads in the 12-lead ECG. These may include ST depression/elevation or T wave inversion, which are not associated with a specific myocardial region, hence termed non-specific repolarization abnormalities.", "high voltage in limb leads": "High voltage in limb leads is diagnosed by looking at leads I, II, and III on a 12-lead ECG. Focus on the amplitude of the QRS complex. If it's >5mm in limb leads, it indicates high voltage, often suggesting left ventricular hypertrophy or other cardiac conditions.", "inverted T wave": "Inverted T waves can be diagnosed from a 12-lead ECG by focusing on leads V1-V6, II, III, and aVF. Look for a negative deflection after the QRS complex in these leads, which indicates an inverted T wave, often suggesting myocardial ischemia or ventricular strain.", "early repolarization": "Look for J-point elevation, notched or slurred QRS complex end in the inferior or lateral leads. Also, check for ST-segment elevation and a concave ST-segment shape. These are key features of early repolarization in a 12-lead ECG.", "severe right axis deviation": "Look at leads I and aVF. If the QRS complex is negative in lead I and positive in aVF, it indicates severe right axis deviation. This could suggest conditions like right ventricular hypertrophy or chronic lung disease.", "sinus bradycardia": "Look for a regular rhythm with a heart rate less than 60 bpm on the ECG. P waves should be present and normal, indicating the impulse is originating from the sinus node. Check all 12 leads, but lead II often provides the clearest view.", "abnormal P wave terminal force": "Look at lead V1 on the ECG. Abnormal P wave terminal force is diagnosed when the terminal negative portion of the P wave is > 1mm in depth and > 0.04 seconds in duration. This indicates left atrial enlargement.", "anterior/septal and lateral ST-T changes": "Anterior/Septal ST-T changes are seen in leads V1-V4. Look for ST elevation or depression, T wave inversion. Lateral ST-T changes appear in leads I, aVL, V5-V6. Again, check for ST segment and T wave changes. Always compare with patient's baseline ECG.", "intraventricular conduction defect": "Look for widened QRS complex (>120 ms) in the ECG. Right bundle branch block shows 'rabbit ear' appearance in V1-V3. Left bundle branch block shows broad, notched or slurred R wave in I, aVL, V5 and V6.", "anterior myocardial injury": "Look for ST-segment elevation in the anterior leads (V1-V4) on a 12-lead ECG. This indicates an anterior myocardial injury. Also, reciprocal changes (ST depression) in inferior leads (II, III, aVF) can be present.", "secondary repolarization abnormality": "Look for ST-segment elevation or depression, T-wave inversion, or abnormal QRS-T angle in the 12-lead ECG. These changes often occur in leads V1-V6, II, III, aVF, and may indicate secondary repolarization abnormalities. Always correlate with clinical context.", "ventricular tachycardia": "Look for wide QRS complexes (>120 ms) at a fast rate (>100 bpm), often with a regular rhythm. The QRS morphology may show a right or left bundle branch block pattern. Absence of associated P waves or dissociation between P waves and QRS complexes can indicate ventricular tachycardia.", "anterior T wave changes": "Focus on leads V1-V4 for anterior T wave changes. Look for T wave inversion, flat T waves, or hyperacute T waves. These changes may indicate ischemia, myocardial infarction, or other cardiac conditions. Always correlate with clinical symptoms and patient history.", "non-specific anterior ST-T changes": "Look for ST segment elevation or depression, T wave inversion in anterior leads (V1-V4). These changes may be subtle. Also, consider patient's symptoms, risk factors. Non-specific changes can indicate ischemia, electrolyte imbalance, or medication effects. Always correlate with clinical picture.", "biventricular hypertrophy": "Biventricular hypertrophy on ECG shows left ventricular hypertrophy (LVH) criteria: tall R wave in lead I, aVL, V5-V6, and deep S wave in V1-V3. Right ventricular hypertrophy (RVH) criteria: R wave in V1 > S wave, or R/S ratio > 1, and right axis deviation.", "prolonged PR interval": "Look at lead II on the ECG. If the time from the start of the P wave (atrial depolarization) to the start of the QRS complex (ventricular depolarization), known as the PR interval, is longer than 200 milliseconds (five small squares), it's a prolonged PR interval.", "ischemic in diffuse leads": "Look for ST-segment depression or T-wave inversion in multiple leads, particularly in leads V4-V6, II, III, aVF. These changes, especially if widespread, can indicate ischemia. Also, consider patient symptoms and risk factors.", "non-specific repolarization abnormality in lateral leads": "Look at leads I, aVL, V5, and V6 for lateral leads. Non-specific repolarization abnormality may show as ST segment depression or elevation, T wave inversion, or abnormal QRS-T angle. These changes are not linked to a specific cardiac condition, hence 'non-specific'.", "inferior myocardial ischemic": "Inferior myocardial ischemia is diagnosed on a 12-lead ECG by ST-segment depression or T-wave inversion in the inferior leads (II, III, aVF). Reciprocal changes may appear in the anterior or lateral leads. Always correlate with clinical symptoms.", "normal ECG": "Focus on P wave, QRS complex, and T wave. Check rate and rhythm. Examine ST segment and QT interval. Look for abnormalities in each lead. Leads II, III, and aVF show inferior wall, V1-V4 show anterior wall, I, aVL, V5, V6 show lateral wall of the heart.", "tall T wave": "Tall T waves are diagnosed on a 12-lead ECG by focusing on leads V2-V6. Look for T wave height exceeding 5mm in limb leads or 10mm in precordial leads. Also, consider the T wave's symmetry, as tall, symmetrical T waves may indicate hyperkalemia.", "generalized low QRS voltages": "Look for QRS complex amplitude <5mm in limb leads or <10mm in precordial leads. Check all 12 leads, as low voltages may be generalized or confined to specific leads. Consider technical issues, patient factors, or pathological conditions causing low voltages.", "second degree (Mobitz II) sinoatrial block": "Look for irregularly dropped QRS complexes without preceding PR interval prolongation in the ECG. This indicates a Mobitz II block. It's often seen in lead II.", "multifocal ventricular premature complex": "Look for premature ventricular complexes (PVCs) with varying morphologies in the same lead. This indicates different ventricular origins, hence multifocal. Check for wide QRS complexes, abnormal axis, and absence of a preceding P wave. Leads V1-V6 are particularly useful for morphology.", "old anterior myocardial infarction": "Look for Q waves in the anterior leads (V1-V4). These are indicative of an old anterior myocardial infarction. Also, check for ST-T changes or T wave inversion in these leads.", "acute myocardial infarction": "Look for ST elevation in two contiguous leads, new left bundle branch block, or development of Q waves. These are indicative of acute myocardial infarction. Also, consider patient symptoms and risk factors.", "inferior/lateral ST-T changes": "Inferior ST-T changes are seen in leads II, III, and aVF. Lateral ST-T changes appear in leads I, aVL, V5, and V6. Look for ST elevation or depression, T wave inversion, or abnormal Q waves in these leads.", "left posterior fascicular block": "Look for right axis deviation (110-180 degrees) in the frontal plane, normal or slightly widened QRS complex, and absence of other causes for right axis deviation in the 12-lead ECG to diagnose left posterior fascicular block.", "non-specific inferior and anterior T wave changes": "Look for T wave inversion or flattening in inferior leads (II, III, aVF) for inferior changes, and in anterior leads (V1-V4) for anterior changes. These non-specific changes can indicate ischemia, electrolyte imbalance, or other cardiac conditions. Always correlate with clinical symptoms.", "slow ventricular response": "Look for a low heart rate (<60 bpm) on the ECG. Check P waves and QRS complexes. If P waves are regular but QRS complexes are irregular and less frequent, it indicates a slow ventricular response, often seen in atrial fibrillation or flutter.", "non-specific inferior and anterior ST-T changes ": "Focus on leads II, III, aVF for inferior changes and V1-V6 for anterior changes. Look for ST-segment elevation or depression, T-wave inversion, or abnormal Q-waves. These changes may indicate myocardial ischemia or injury.", "borderline ST segment depression in diffuse lead": "Look for slight downward sloping or horizontal ST segments in multiple leads. Borderline ST depression is typically 0.5-1mm below the baseline. It's often seen in leads II, III, aVF (inferior leads), and V4-V6 (lateral leads). Always compare with patient's symptoms and history.", "borderline prolonged PR interval": "Look at lead II on the ECG. If the PR interval (time from start of P wave to start of QRS complex) is between 200-220 ms, it's borderline prolonged. Check for consistency across multiple beats.", "non-specific anteroseptal ST segment changes": "Focus on leads V1-V4 for anteroseptal changes. Look for ST segment elevation or depression, T wave inversion, or Q waves. These changes may indicate myocardial ischemia or infarction. Always correlate with clinical symptoms and patient history.", "extensive ST segment elevation": "Look for ST segment elevation in two contiguous leads. Extensive ST elevation often involves multiple coronary arteries, so check multiple lead groups. V1-V4 elevation suggests anterior wall, II, III, aVF for inferior wall, and I, aVL, V5-V6 for lateral wall involvement.", "inferior and lateral T wave changes": "Inferior T wave changes are seen in leads II, III, and aVF. Lateral T wave changes appear in leads I, aVL, V5, and V6. Look for inversion, flattening, or hyperacute changes in these leads. Always compare with previous ECGs if available.", "atrioventricular junctional (nodal) bradycardia": "Look for a regular rhythm with a rate less than 60 bpm in the ECG. P waves may be absent or inverted, and if present, they follow the QRS complex. The QRS complex is usually normal, indicating the rhythm originates from the AV junction.", "non-specific anteroseptal T wave changes": "Focus on leads V1-V4 for anteroseptal changes. Non-specific T wave changes may include inversion, flattening, or asymmetry. However, these changes can be benign or due to non-cardiac causes. Always correlate with clinical history and consider further testing if needed.", "first degree atrioventricular block": "Look for a prolonged PR interval (>200ms) in all leads of the ECG. This delay in electrical conduction from atria to ventricles signifies a first degree atrioventricular block. The rest of the ECG may be normal.", "borderline repolarization abnormality in diffuse leads": "Look for slight deviations in ST segment, T wave changes across multiple leads. Focus on leads II, III, aVF (inferior), V1-V6 (anterior and lateral). Borderline repolarization abnormality often lacks a specific pattern, making it challenging to diagnose. Always correlate with clinical symptoms.", "inferior myocardial infarction": "Inferior myocardial infarction is diagnosed on a 12-lead ECG by ST-segment elevation in the inferior leads (II, III, aVF). Reciprocal changes may be seen in the lateral leads (I, aVL). Look for Q waves as they indicate old infarctions.", "non-specific ST segment changes": "Look for ST segment elevation or depression in multiple leads. Non-specific changes may include slight elevation or depression, or T-wave inversion. These changes may not localize to a specific coronary artery territory, making them \"non-specific\". Always correlate with patient symptoms and history.", "borderline anterolateral ST-T changes": "Look for subtle changes in leads I, aVL, V5, and V6. Focus on ST-segment elevation or depression, T-wave inversion, or flat T-waves. These changes may be minimal but consistent, indicating borderline anterolateral ST-T changes. Always correlate with clinical symptoms and history.", "borderline lateral T wave changes": "Look at leads I, aVL, V5, and V6 for lateral T wave changes. Focus on T wave inversion, flat T waves, or biphasic T waves. These changes may indicate borderline lateral ischemia or strain pattern. Always correlate with clinical symptoms and patient history.", "aberrantly conducted supraventricular complexes": "Look for P waves preceding QRS complexes in all leads. If QRS is wide (>120ms), it's aberrantly conducted. If narrow, it's normally conducted. Also, check PR interval. If it's short (<120ms), suspect pre-excitation or junctional rhythm.", "anterolateral ST-T changes": "Look for ST elevation in leads I, aVL, V5, and V6 for anterolateral changes. ST depression or T wave inversion may also be present. These changes suggest myocardial ischemia or injury.", "rSr' pattern in V1 or V2 leads": "Look at leads V1 or V2 in the 12-lead ECG. The rSr' pattern is characterized by a small R wave (r), followed by a deep S wave (S), and a second small R wave (r'). This pattern is often seen in right bundle branch block.", "septal ST-T changes": "Look at leads V1-V3 for septal ST-T changes. Focus on ST-segment elevation or depression, T-wave inversion, and abnormal Q-waves. These changes may indicate myocardial ischemia, injury, or infarction in the septal region of the heart.", "pericarditis": "Look for widespread ST elevation and PR depression in the limb leads (I, II, III, aVF, aVL, aVR), and V4-V6. The ST elevation in pericarditis is usually concave upwards. Reciprocal ST depression and PR elevation in lead aVR may also be present.", "anteroseptal ST segment depression": "Look at leads V1-V4 for anteroseptal changes. ST segment depression indicates ischemia. Identify horizontal or downsloping ST depression ≥ 0.5mm at 0.08s from J point in two contiguous leads. Also, check for T wave inversion.", "sinus pause": "Look for missing P-QRS-T complexes in a regular rhythm on the ECG. The pause duration is a multiple of the preceding P-P interval. No compensatory pause is seen. Check all 12 leads, but lead II gives the best view of P waves.", "varied atrioventricular block": "Look for PR interval prolongation in lead II. First-degree block has constant but prolonged PR (>200ms). Second-degree Mobitz I shows increasing PR until a beat is dropped. Mobitz II has constant PR with random dropped beats. Third-degree block shows no relation between P waves and QRS complexes.", "ventricular hypertrophy": "Look for increased R wave amplitude in left ventricular hypertrophy (LVH) in leads I, AVL, V5-V6, and deep S waves in V1-V2. For right ventricular hypertrophy (RVH), look for R wave dominance in V1 and deep S waves in V5-V6.", "low QRS voltages in limb leads": "Low QRS voltages in limb leads are diagnosed when the amplitude of the QRS complex is less than 5mm in all limb leads on a 12-lead ECG. Focus on leads I, II, III, aVL, aVF, and aVR.", "borderline T wave changes in diffuse lead": "Look for subtle changes in T wave morphology across multiple leads in 12-lead ECG. Pay attention to leads II, III, aVF (inferior), V4-V6 (lateral), and V1-V3 (anterior). Look for slight flattening, inversion, or notching of T waves, which may indicate borderline changes.", "borderline inferior T wave changes ": "Focus on leads II, III, and aVF for inferior changes. Borderline inferior T wave changes may show slight flattening or inversion of T waves. However, these changes can be normal variants, so consider patient's history, symptoms, and other ECG findings for accurate diagnosis.", "acute pericarditis": "Look for widespread ST elevation and PR depression in most leads except aVR and V1 (where it's reversed). These changes, along with clinical symptoms, can indicate acute pericarditis.", "extensive intraventricular conduction defect": "Look for widened QRS complex (>120 ms) in multiple leads. Check for bundle branch block patterns. Right bundle branch block shows 'M' shape in V1-V3. Left bundle branch block shows 'W' shape in V1-V3 and 'M' in V4-V6. Absence of Q waves in lateral leads indicates left bundle branch block.", "acute posterior myocardial infarction": "Look for ST depression in V1-V3 leads, indicating posterior wall MI. Also, check for tall, broad R waves in the same leads. These are reciprocal changes due to posterior wall injury. Confirm with posterior leads (V7-V9) if available, where you'd expect ST elevation.", "bigeminal atrial premature complex": "Look for irregular rhythm in ECG. Bigeminal atrial premature complexes show a normal beat followed by a premature beat, repeating in pairs. Premature beats have different P-wave morphology, often seen in leads II, III, aVF, V1-V3. PR interval may be shorter for premature beats.", "extensive T wave changes": "Look for T wave inversion in multiple leads, especially in leads V1-V4. Also, check for T wave flattening. Pay attention to ST segment changes. These could indicate myocardial ischemia or other cardiac conditions. Always correlate with clinical symptoms and history.", "long QTc interval": "Look at leads II, V5, or V6 on the ECG. Measure the QT interval from the start of the QRS complex to the end of the T wave. Correct it for heart rate (QTc). If QTc is >440ms in men or >460ms in women, it's considered long.", "bradycardia": "Bradycardia is diagnosed when heart rate is below 60 bpm on ECG. Check rhythm regularity, P wave presence, and PR interval in all 12 leads. If rhythm is regular, P waves are present and PR interval is normal, it's likely sinus bradycardia.", "ectopic atrial bradycardia": "Look for a heart rate below 60 bpm, P waves preceding each QRS complex, and P wave morphology different from sinus P waves in leads II, III, and aVF. This indicates atrial activity originating outside the sinus node, hence ectopic atrial bradycardia.", "borderline high QRS voltage": "Look for increased amplitude of QRS complexes in limb leads (I, II, III, aVF, aVL, aVR) and precordial leads (V1-V6). If R wave in V5/V6 or S wave in V1/V2 is >25mm, or sum of S in V1 and R in V5/V6 is >35mm, it's borderline high QRS voltage.", "non-specific septal and lateral ST-T changes": "Look for ST segment elevation or depression and T wave inversion in septal leads (V1-V2) for septal changes, and in lateral leads (I, aVL, V5-V6) for lateral changes. These may indicate myocardial ischemia or injury.", "low voltage in the extremity leads": "Low voltage in extremity leads is diagnosed when the amplitude of QRS complexes in all limb leads (I, II, III, aVL, aVF, aVR) is less than 5mm. Look for small, weak signals across these leads on the ECG.", "normal variant": "Focus on rate, rhythm, axis, and intervals. Look for P waves, QRS complexes, and T waves in all 12 leads. Normal variants include early repolarization, benign T wave inversion, and incomplete right bundle branch block. Always compare with previous ECGs if available.", "myocardial ischemic in diffuse leads": "Look for ST-segment depression or T-wave inversion in multiple leads. Diffuse ischemia often affects leads I, II, III, aVF, aVL, aVR, V1-V6. Pay attention to reciprocal changes. Remember, clinical correlation is essential.", "undetermined rhythm": "Focus on rate, regularity, P waves, PR interval, and QRS complex. Check lead II for overall rhythm, V1 for bundle branch blocks, and aVR for axis. Look for abnormalities like arrhythmias, ischemia, or infarction. Always correlate with clinical symptoms.", "non-specific inferior/lateral ST-T changes": "Look for ST-segment depression or T-wave inversion in inferior (II, III, aVF) and lateral leads (I, aVL, V5-V6). These changes may indicate ischemia. However, non-specific changes can be due to various factors, including electrolyte imbalance, medication, or strain patterns. Always correlate with clinical symptoms.", "abnormally high lewis index": "As an Electrocardiologist, diagnosing high Lewis Index involves focusing on leads V1-V3. Look for a prominent R wave in V1 and deep S wave in V3. The Lewis Index is calculated as (R wave in V1 + S wave in V3) > 35mm.", "non-specific inferior and septal ST-T changes": "Focus on leads II, III, aVF (inferior) and V1, V2 (septal). Look for ST segment elevation or depression, T wave inversion or flat T waves. These changes may indicate myocardial ischemia, but are non-specific and should be correlated with clinical symptoms and other diagnostic tests.", "old lateral myocardial infarction": "Look for Q waves in lateral leads (I, aVL, V5-V6). These indicate old lateral myocardial infarction. Also, check for ST-segment changes or T-wave inversions, but these may not be present in old infarctions.", "lateral T wave changes": "Look at leads I, aVL, V5, and V6 for lateral T wave changes. Focus on T wave inversion, flat T waves, or ST segment depression. These changes may indicate ischemia or infarction in the lateral wall of the heart.", "non-specific anterior/septal and lateral T wave changes": "Look for T wave inversion or flattening in anterior/septal leads (V1-V4) and lateral leads (I, aVL, V5-V6). These changes may indicate ischemia. However, non-specific T wave changes can be normal variants or due to other conditions, so correlate with clinical context.", "nonsustained ventricular tachycardia": "Look for three or more consecutive rapid heartbeats originating from the ventricles on the ECG. The rate is typically over 100 beats per minute. The QRS complexes will be wide and bizarre. It stops spontaneously within 30 seconds. Check all leads for a comprehensive view.", "non-specific inferior/lateral ST changes": "Focus on leads II, III, aVF (inferior) and I, aVL, V5-V6 (lateral). Look for ST-segment elevation or depression, T-wave inversion, or abnormal Q-waves. These changes may indicate myocardial ischemia or injury. Always correlate with clinical symptoms and patient history.", "low voltage in the precordial leads": "Low voltage in precordial leads is diagnosed when the R wave in leads V4-V6 or the S wave in V1-V3 is less than 5mm. Focus on these leads and measure the amplitude of these waves.", "non-specific anteroseptal ST-T changes": "Look for changes in leads V1-V4, which represent the anteroseptal area. Non-specific ST-T changes can include ST segment depression or elevation, T wave inversion, or abnormal Q waves. These changes may indicate ischemia, injury, or infarction. Always correlate with clinical symptoms.", "QRS changes": "Focus on leads II, III, and aVF for inferior changes; V1-V4 for anterior changes; I, aVL, V5, V6 for lateral changes. Look for QRS duration, axis deviation, abnormal Q waves, R wave progression, and bundle branch blocks.", "incomplete left bundle branch block": "Look for slightly prolonged QRS duration (90-120 ms) in lead V6. There should be a small R wave followed by a larger S wave in V1, and a broad monophasic R wave in V6. These are key signs of incomplete left bundle branch block.", "low R waves in anteroseptal leads": "Focus on leads V1-V4 for anteroseptal R waves. Low R waves may indicate myocardial infarction. Look for small or absent R waves, ST segment depression, and T wave inversion. Always compare with previous ECGs if available.", "aberrant ventricular conduction": "Look for wide QRS complexes (>120 ms) in the ECG. In leads V1-V3, if the QRS complex is predominantly negative, it suggests left bundle branch block. If it's predominantly positive, it suggests right bundle branch block.", "biatrial enlargement": "Biatrial enlargement is diagnosed on a 12-lead ECG by looking for P wave changes. In lead II, a bifid P wave with >40ms between peaks suggests left atrial enlargement. In V1, a biphasic P wave with a terminal negative component >40ms indicates right atrial enlargement.", "atrioventricular junctional rhythm": "Look for a regular rhythm with a rate of 40-60 bpm, absent P waves or P waves after the QRS complex, and a narrow QRS complex in the 12-lead ECG. This indicates an atrioventricular junctional rhythm.", "accelerated idioventricular rhythm": "Look for a regular rhythm with a rate of 40-120 bpm, wide QRS complexes (>120 ms), and absence of P waves before each QRS complex. The rhythm originates from the ventricles, hence the term idioventricular. It's faster than normal idioventricular rhythm, hence accelerated.", "non-specific septal T wave changes": "Look for T wave inversion or flattening in septal leads (V1-V2). However, non-specific septal T wave changes can be normal variants. Always correlate with clinical history, other ECG findings, and consider further testing if needed.", "anterolateral myocardial ischemic": "Look for ST-segment depression or T-wave inversion in leads I, aVL, V5, and V6. These changes suggest anterolateral myocardial ischemia. Also, consider patient symptoms and risk factors for a comprehensive diagnosis.", "junctional tachycardia": "Look for a heart rate over 100 bpm, narrow QRS complexes, and absent or inverted P waves before the QRS complex in leads II, III, and aVF. This indicates junctional tachycardia.", "inferior and septal ST segment elevation": "Inferior ST elevation is seen in leads II, III, and aVF. Septal ST elevation appears in V1 and V2. Look for upward deflection from baseline after QRS complex. This indicates myocardial ischemia or injury.", "myocardial ischemia": "Look for ST-segment depression or T-wave inversion in leads V1-V6, I, aVL (lateral ischemia) or II, III, aVF (inferior). ST-elevation may indicate acute myocardial infarction. Also, check for Q waves, which suggest past infarction.", "ST segment elevation": "Look for a J-point elevation of >1mm in two contiguous leads in 12-lead ECG. The ST segment should be concave or horizontal. Check leads V1-V6, II, III, aVF for anterior and inferior wall elevation. Leads I, aVL, V5, V6 indicate lateral wall elevation.", "anterior ST segment elevation": "Look for ST segment elevation in the precordial leads V1-V4. This indicates an anterior myocardial infarction. The ST segment should be elevated >1mm above the isoelectric line, 80ms after the J point. Also, reciprocal changes may be seen in inferior leads (II, III, aVF).", "anterior myocardial infarction": "Look for ST-segment elevation in the anterior precordial leads (V1-V4) on a 12-lead ECG. This elevation, along with reciprocal changes in other leads, indicates an anterior myocardial infarction.", "left axis deviation": "Check leads I and aVF on the ECG. If the QRS complex is negative in lead aVF and positive in lead I, it indicates left axis deviation. This is due to the heart's electrical axis shifting more to the left than normal.", "uncontrolled ventricular response": "Look for irregular rhythm, absence of P waves, and rapid ventricular rate (100-180 bpm) in all leads. Specifically, in leads V1-V2, you may see a 'sawtooth' pattern. This suggests uncontrolled ventricular response in conditions like atrial fibrillation.", "borderline septal T wave changes ": "Look for T wave inversion in leads V1-V3. If inversion is less than 1mm, it's borderline. Also, consider patient's age, sex, and race. Rule out right bundle branch block, right ventricular hypertrophy, or pulmonary disease. Always correlate with clinical history.", "anterolateral myocardial infarction": "Look for ST-segment elevation in leads I, aVL, V5, and V6. Reciprocal changes may appear in inferior leads. Q waves may develop. These indicate an anterolateral myocardial infarction.", "acute inferior myocardial infarction": "Look for ST-segment elevation in inferior leads (II, III, aVF). Reciprocal changes (ST depression) may appear in aVL or I. Presence of Q waves in these leads may indicate older infarction. Confirm with clinical symptoms and biomarkers.", "extensive ST elevation": "Look for ST segment elevation in two contiguous leads. Extensive ST elevation often indicates a major heart attack. It's typically seen in leads V1-V6, I, aVL (anterior or lateral wall) or II, III, aVF (inferior wall). The elevation should be >1mm in limb leads and >2mm in precordial leads.", "sinus/ectopic atrial rhythm": "Look for regular rhythm and rate (60-100 bpm) for sinus rhythm. P waves should be upright in leads I, II, aVF and V2-V6. For ectopic atrial rhythm, rate is usually 60-100 bpm, but P waves may have abnormal morphology or direction.", "marked ST segment depression in V1,V2,V3,V4,V5,V6": "Look for a downward sloping or horizontal ST segment that's below the baseline in leads V1-V6. This is ST segment depression. It's marked if it's ≥0.5mm. It may indicate myocardial ischemia or other cardiac conditions. Always correlate with clinical symptoms.", "non-specific inferior ST segment changes": "Focus on leads II, III, and aVF for inferior changes. Look for ST segment depression or elevation, T wave inversion, or abnormal Q waves. These changes may indicate ischemia, injury, or infarction. Always correlate with clinical symptoms and patient history.", "lateral myocardial injury": "Lateral myocardial injury is typically indicated on a 12-lead ECG by ST-segment elevation in leads I, aVL, V5, and V6. Look for Q waves and T wave inversion as well.", "Q waves in anteroseptal leads": "Focus on leads V1-V4 for anteroseptal Q waves. Look for a Q wave duration >0.04 seconds or a Q wave depth >25% of the following R wave. These may indicate myocardial infarction.", "QRS axis leftward": "Look at leads I and aVF. If QRS complex is positive in lead I and negative in aVF, the QRS axis is leftward. This indicates Left Axis Deviation, often due to left ventricular hypertrophy or left anterior fascicular block.", "dextrocardia": "In dextrocardia, ECG shows right axis deviation, positive QRS complex in aVR, and negative in lead I. P, QRS, and T waves are inverted in leads I, aVL, and often V4-V6. These are key features to focus on.", "ventricular pre-excitation": "Look for a short PR interval (<120 ms) and a delta wave (slurred upstroke at the start of the QRS complex) in the 12-lead ECG. These are hallmark signs of ventricular pre-excitation.", "non-specific anterolateral ST segment changes": "Look for ST segment changes in leads I, aVL, V5, and V6. These represent the anterolateral wall. Non-specific changes can include ST elevation, depression, or T-wave inversion. However, these changes should be interpreted in clinical context as they can also occur in normal variants.", "sinus/ectopic atrial bradycardia": "Look for a heart rate below 60 bpm on the ECG. Sinus bradycardia will have a regular P wave before each QRS complex. Ectopic atrial bradycardia will have irregular P waves or P waves that differ in shape. Check all 12 leads for consistency.", "paired ventricular premature complexes": "Look for two premature ventricular complexes (PVCs) in a row on the ECG. They appear as wide, bizarre QRS complexes without a preceding P wave, often followed by a compensatory pause. They can be seen in any lead but are most noticeable in the chest leads (V1-V6).", "marked precordial ST segment depression": "Look for ST segment depression in precordial leads (V1-V6). Marked depression is typically >2mm below baseline. It may indicate myocardial ischemia, ventricular hypertrophy, or digitalis effect. Always correlate with patient symptoms and history.", "anterior Q waves": "Anterior Q waves are diagnosed on 12-lead ECG by observing leads V1-V4. Look for a small negative deflection (Q wave) before the R wave. Pathological Q waves are typically >40ms wide and >2mm deep, indicating possible anterior myocardial infarction.", "old anteroseptal myocardial infarction": "Look for pathological Q waves in leads V1-V3, indicative of old anteroseptal myocardial infarction. These are Q waves >0.04 seconds or a QS complex in these leads. Also, check for ST-T wave changes, but they may normalize over time.", "non-specific anterior ST segment changes": "Focus on leads V1-V4 for anterior changes. Look for ST segment elevation or depression, T wave inversion, or abnormal Q waves. These changes may indicate myocardial ischemia, injury, or infarction. Always correlate with clinical symptoms and patient history.", "abnormal ventricular conduction pathways": "Look for wide QRS complexes (>120ms) in the ECG. Leads V1-V3 can show bundle branch blocks. Right bundle branch block (RBBB) shows 'M' shape in V1 and 'W' in V6. Left bundle branch block (LBBB) shows 'W' in V1 and 'M' in V6.", "inferior and lateral ST-T changes": "Inferior ST-T changes are seen in leads II, III, and aVF. Lateral ST-T changes appear in leads I, aVL, V5, and V6. Look for ST-segment elevation or depression, T-wave inversion, or abnormal Q-waves in these leads.", "atrial flutter": "Look for regular atrial activity at around 300 bpm in leads II, III, and aVF. The classic \"sawtooth\" pattern, especially in inferior leads, is indicative of atrial flutter. Also, check for variable ventricular response.", "Q waves in inferior and anterior/septal leads": "Look for Q waves in inferior leads (II, III, aVF) and anterior/septal leads (V1-V4). Q waves are normal if <0.04s wide and <25% of the following R wave. Pathological Q waves suggest myocardial infarction.", "abnormal R wave progression": "Look at precordial leads V1-V6. Normal R wave progression: R wave gets larger and S wave gets smaller from V1 to V6. Abnormal progression: R wave stays small or S wave stays large in V4-V6, or sudden change in R/S ratio.", "old anterolateral myocardial infarction": "Look for pathological Q waves in the anterolateral leads (I, aVL, V4-V6). These indicate old myocardial infarction. Also, check for ST segment and T wave changes. Reduced R wave progression can also be a sign."}